## Coles Supermarkets
### Average price of flavoured milk

In [1]:
import pandas as pd

In [2]:
file_one = "flovredmilk(1L).csv"

In [3]:
df = pd.read_csv(file_one, encoding="ISO-8859-1")

In [4]:
df.head()

,_id,price,title
0,63d5ac43d0f7cf9498569f92,$3.30,Boss Vanilla Latte Coffee | 237mL
1,63d5ac44d0f7cf9498569f93,$2.90,Dare Double Espresso Flavoured Milk | 500mL
2,63d5ac44d0f7cf9498569f94,$3.00,Vitasoy Iced Coffee Soy Milk | 1L
3,63d5ac44d0f7cf9498569f95,$3.30,Boss Caramel Coffee | 237mL
4,63d5ac44d0f7cf9498569f96,$2.00,Bubble Milk Tea Original With Tapioca Pearls |...

In [5]:
df.dtypes

_id      object
price    object
title    object
dtype: object

In [6]:
df['price'] = df['price'].str.replace('$', '')
df['price']

0     3.30
1     2.90
2     3.00
3     3.30
4     2.00
5     2.50
6     2.90
7     3.80
8     2.90
9     5.30
10    6.00
11    1.95
12    2.00
13    2.50
14    3.60
15    3.80
16    2.50
17    3.60
18    9.00
19    3.55
20    2.90
21    3.00
22    3.80
23    5.80
24    2.40
25    3.80
26    2.90
27    3.60
28    4.00
29    2.90
30    4.95
31    2.00
32    2.40
33    3.00
34    2.00
35    3.30
36    4.00
37    5.00
38    2.00
39    4.75
Name: price, dtype: object

In [7]:

df['price'] = pd.to_numeric(df['price'])

In [8]:
df.dtypes

_id       object
price    float64
title     object
dtype: object

In [9]:
average = df["price"].mean()
average

3.4724999999999993


### Average Bread price

In [10]:
file_two = "bread.csv"
df2 = pd.read_csv(file_two, encoding="ISO-8859-1")
df2.head()

,_id,price,title
0,63d5bb213242b32ce9216317,$0.95,Coles Cracker Squares | 250g
1,63d5bb213242b32ce9216318,$0.95,Coles Cracked Pepper Water Crackers | 125g
2,63d5bb213242b32ce9216319,$0.95,Coles Original Water Crackers | 125g
3,63d5bb213242b32ce921631a,$1.30,Coles Bakery High Top Half Sandwich Loaf | 320g
4,63d5bb213242b32ce921631b,$1.30,Coles Bakery High Top Half Toast Loaf | 320g

In [11]:
df2.dtypes

_id      object
price    object
title    object
dtype: object

In [12]:
df2['price'] = df2['price'].str.replace('$', '')
df2['price'] = pd.to_numeric(df2['price'])

In [13]:
df2.dtypes

_id       object
price    float64
title     object
dtype: object

In [14]:
average2= df2["price"].mean()
average2

1.8723404255319156

In [15]:
average2.round()

2.0

## Average price jam honey spread

In [17]:
file_three = "jam honey spread.csv"
df3 = pd.read_csv(file_three, encoding="ISO-8859-1")
df3.head()

                        _id  price                                     title
0  63d5bee734437fd22db5719a  $9.75  Nutella Hazelnut Chocolate Spread | 750g
1  63d5bee734437fd22db5719b  $5.70  Nutella Hazelnut Chocolate Spread | 400g
2  63d5bee734437fd22db5719c  $5.35         Bonne Maman Strawberry Jam | 370g
3  63d5bee734437fd22db5719d  $8.50                    B Honey Squeeze | 450g
4  63d5bee734437fd22db5719e  $5.00                    B Honey Squeeze | 300g

In [18]:
df3.dtypes

_id      object
price    object
title    object
dtype: object

In [19]:
df3['price'] = df3['price'].str.replace('$', '')
df3['price'] = pd.to_numeric(df3['price'])

In [20]:
df3.dtypes

_id       object
price    float64
title     object
dtype: object

In [21]:
average3= df3["price"].mean()
average3.round(2)

5.44

## Average price of meat(lamb)

In [22]:
file_four = "meat.csv"
df4 = pd.read_csv(file_four, encoding="ISO-8859-1")
df4.head()

,_id,price,title
0,63d5c1f86a0d401a195d7588,$6.25,Coles Lamb Mini Rump Roast In Red Wine Jus | a...
1,63d5c1f86a0d401a195d7589,$6.72,Coles Lamb Loin Chops With Sea Salt And Rosema...
2,63d5c1f86a0d401a195d758a,$6.94,Coles Lamb Meat Bones | approx. 991g
3,63d5c1f86a0d401a195d758b,$7.70,Coles Lamb Meat Bones | approx. 1.1kg
4,63d5c1f86a0d401a195d758c,$7.50,Coles Rump Steak 2 Pack | 215g

In [23]:
df4.dtypes

_id      object
price    object
title    object
dtype: object

In [24]:
df4['price'] = df4['price'].str.replace('$', '')
df4['price'] = pd.to_numeric(df4['price'])

In [25]:
df4.dtypes

_id       object
price    float64
title     object
dtype: object

In [26]:
average4= df4["price"].mean()
average4.round(2)

16.5

In [27]:
average4= df4["price"].median()
average4.round(2)

15.0

## Average price of choclates-bar

In [28]:
file_five = "choclates.csv"
df5 = pd.read_csv(file_five, encoding="ISO-8859-1")
df5.head()

,_id,price,title
0,63d5c6c95d4e070cdd661df7,$0.90,Cadbury Flake Chocolate Bar | 30g
1,63d5c6c95d4e070cdd661df8,$0.90,Cadbury Turkish Delight Chocolate Bar | 55g
2,63d5c6c95d4e070cdd661df9,$0.90,Cadbury Crunchie Chocolate bar | 50g
3,63d5c6c95d4e070cdd661dfa,$0.90,Cadbury Bars Chocolate Cherry Ripe | 52g
4,63d5c6c95d4e070cdd661dfb,$0.90,Cadbury Picnic Chocolate Bar | 46g

In [29]:
df5.dtypes

_id      object
price    object
title    object
dtype: object

In [30]:
df5['price'] = df5['price'].str.replace('$', '')
df5['price'] = pd.to_numeric(df5['price'])

In [31]:
df5.dtypes

_id       object
price    float64
title     object
dtype: object

In [32]:
average5= df5["price"].mean()
average5.round(2)

1.37

## Average price of cofee

In [33]:
file_six = "cofee.csv"
df6 = pd.read_csv(file_six, encoding="ISO-8859-1")
df6.head()

,_id,price,title
0,63d598a622f89f2c6d43c475,$3.25,Daley Street Medium/Dark Aluminium Nespresso C...
1,63d598a622f89f2c6d43c476,$3.25,Daley Street Daley Street Medium Aluminium Nes...
2,63d598a622f89f2c6d43c477,$3.25,Daley Street Dark Aluminium Nespresso Compatib...
3,63d598a622f89f2c6d43c478,$3.25,Daley Street Intense Aluminium Nespresso Compa...
4,63d598a622f89f2c6d43c479,$3.25,Daley Street Dark/Intense Aluminium Nespresso ...

In [34]:
df6.dtypes

_id      object
price    object
title    object
dtype: object

In [35]:
df6['price'] = df6['price'].str.replace('$', '')
df6['price'] = pd.to_numeric(df6['price'])

In [36]:
df6.dtypes

_id       object
price    float64
title     object
dtype: object

In [37]:
average6= df6["price"].mean()
average6.round(2)

4.56